stories/notes/nikola.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="How to setup Nikola for making static websites">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Nikola | Kyle M. Douglass</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://kmdouglass.github.io/stories/notes/nikola.html">
<!--[if lt IE 9]><![endif]--><meta name="description" itemprop="description" content="How to setup Nikola for making static websites">
<meta name="author" content="Kyle M. Douglass">
<meta property="og:site_name" content="Kyle M. Douglass">
<meta property="og:title" content="Nikola">
<meta property="og:url" content="http://kmdouglass.github.io/stories/notes/nikola.html">
<meta property="og:description" content="How to setup Nikola for making static websites">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2014-12-26T00:00:00+01:00">
<meta property="article:tag" content="nikola">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-default navbar-static-top" role="navigation"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://kmdouglass.github.io/">

                <span id="blog-title">Kyle M. Douglass</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/index.html">Tags</a>
                </li>
<li>
<a href="../notes-and-projects.html">Notes</a>
                </li>
<li>
<a href="../about-me.html">About</a>
                </li>
<li>
<a href="../contact.html">Contact</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="nikola.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Nikola</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li>
<a href="nikola.html#sec-1">First steps</a>
<ul>
<li><a href="nikola.html#sec-1-1">Initialize the site</a></li>
<li><a href="nikola.html#sec-1-2">Install and configure the org-mode plugin</a></li>
<li><a href="nikola.html#sec-1-3">Setting the github_deploy variables</a></li>
</ul>
</li>
<li>
<a href="nikola.html#sec-2">Customization</a>
<ul>
<li><a href="nikola.html#sec-2-1">Customization and Mako tutorial</a></li>
<li><a href="nikola.html#sec-2-2">Set the theme to bootstrap3 with a color scheme from bootswatch</a></li>
<li><a href="nikola.html#sec-2-3">Changing bootswatch navbar elements</a></li>
<li><a href="nikola.html#sec-2-4">Navigation links</a></li>
<li><a href="nikola.html#sec-2-5">Adding Disqus comments</a></li>
<li><a href="nikola.html#sec-2-6">Redirects</a></li>
<li><a href="nikola.html#sec-2-7">Code syntax highlighting and the orgmode plugin</a></li>
<li><a href="nikola.html#sec-2-8">Teasers</a></li>
<li><a href="nikola.html#sec-2-9">Adding MathJax support to all pages</a></li>
</ul>
</li>
<li>
<a href="nikola.html#sec-3">Errors</a>
<ul>
<li><a href="nikola.html#sec-3-1">Duplicated definition of render_listings</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">First steps</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Initialize the site</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Type the following at the command line to initialize a new Nikola
site:
</p>

<div class="highlight"><pre>nikola init site_name
</pre></div>

<p>
Answer the questions to setup the initial site. Be sure the base
URL ends in '/'.
</p>

<hr>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Install and configure the org-mode plugin</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Nikola can compile org-mode files using a custom
plugin. Information on the plugin can be found here:
<a href="http://plugins.getnikola.com/#orgmode">http://plugins.getnikola.com/#orgmode</a>. To install the plugin for my
site, I ran the following command from inside my site directory:
</p>

<div class="highlight"><pre>nikola plugin -i orgmode
</pre></div>

<p>
This created a folder called <i>plugins</i> inside the site directory
containing the orgmode plugin files. The most important file is
init.el.
</p>

<p>
Next, I had to add the org-mode compiler to the COMPILERS
dictionary in conf.py:
</p>

<div class="highlight"><pre><span class="n">COMPILERS</span><span class="p">[</span><span class="s">"orgmode"</span><span class="p">]</span> <span class="o">=</span> <span class="p">(</span><span class="s">'.org'</span><span class="p">,)</span>
</pre></div>

<p>
Note that I manually edited the COMPILERS dictionary to add the
key-value pair; I did not actually add to the dictionary with the
code above. 
</p>

<p>
I also had to modify my POSTS and PAGES variables in
conf.py to read .org files:
</p>

<div class="highlight"><pre><span class="n">POSTS</span> <span class="o">=</span> <span class="n">POSTS</span> <span class="o">+</span> <span class="p">((</span><span class="s">"posts/*.org"</span><span class="p">,</span> <span class="s">"posts"</span><span class="p">,</span> <span class="s">"post.tmpl"</span><span class="p">),)</span>
<span class="n">PAGES</span> <span class="o">=</span> <span class="n">PAGES</span> <span class="o">+</span> <span class="p">((</span><span class="s">"stories/*.org"</span><span class="p">,</span> <span class="s">"posts"</span><span class="p">,</span> <span class="s">"post.tmpl"</span><span class="p">),)</span>
</pre></div>

<p>
To create a post using org-mode, I need to enter the following code
at the top of the org-file in a comments section:
</p>

<div class="highlight"><pre>#+BEGIN_COMMENT
.. title:
.. slug: 
.. date: 
.. tags: 
.. link:
.. description:
.. type: text
#+END_COMMENT
</pre></div>

<hr>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Setting the github_deploy variables</h3>
<div class="outline-text-3" id="text-1-3">
<p>
When publishing a project website on GitHub, you push the website
files to a branch called <b>gh-pages</b>. However, when publishing a
GitHub user page, the files are pushed to the <b>master</b> branch.
</p>

<p>
By default, Nikola is configured to push to gh-pages. For my
personal website, I need to change the deploy branch to master. I
can do this in the conf.py file by uncommenting and modifying the
line for the <code>GITHUB_DEPLOY_BRANCH</code> variable:
</p>

<div class="highlight"><pre><span class="n">GITHUB_DEPLOY_BRANCH</span> <span class="o">=</span> <span class="s">'master'</span>
</pre></div>

<hr>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Customization</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Customization and Mako tutorial</h3>
<div class="outline-text-3" id="text-2-1">
<p>
There is a great tutorial for customizing Nikola pages and using
Mako at <a href="http://www.shisaa.jp/postset/nikola-web.html"></a><a href="http://www.shisaa.jp">http://www.shisaa.jp</a>.
</p>

<hr>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Set the theme to bootstrap3 with a color scheme from bootswatch</h3>
<div class="outline-text-3" id="text-2-2">
<p>
First, install the bootstrap3 theme from the themes repository. In
the end, I don't think this part is necessary.
</p>

<div class="highlight"><pre>nikola install_theme bootstrap3
</pre></div>

<p>
Next, change the color scheme to darkly from bootswatch.com.
</p>

<div class="highlight"><pre>nikola bootswatch_theme -n custom_theme -s darkly -p bootstrap3
</pre></div>

<p>
Finally, change the theme variable to <code>custom_theme</code> inside
conf.py.
</p>

<hr>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Changing bootswatch navbar elements</h3>
<div class="outline-text-3" id="text-2-3">
<p>
I am using the <a href="http://bootswatch.com/darkly/">Darkly</a> swatch in Nikola's bootstrap3 theme. This
swatch has two menu bars; one is blue and the other green. When I
installed this swatch, the default was set to green, but I wanted
the blue one.
</p>

<p>
To change this, I had to change the <code>base.tmpl</code> file in
<code>themes/bootstrap3/templates/base.tmpl</code>. (If you're using a
virtualenv, you will find these inside the nikola site-packages
data folder; see the end of this section.) In the Menubar section,
I found the tag
</p>

<div class="highlight"><pre>&amp;lt;nav class="navbar navbar-inverse navbar-fixed-top" role="navigation"&amp;gt;
</pre></div>

<p>
and changed navbar-inverse to navbar-default, the name of the
swatch element.
</p>

<p>
<b>NOTE:</b> In recent versions of Nikola (at least 7.3.1), the
bootstrap3 css files were moved. In my nikola virtualenv, I now
find them in
~/envs/nikola/lib/python3.4/site-packages/nikola/data/themes.
</p>
<hr>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Navigation links</h3>
<div class="outline-text-3" id="text-2-4">
<p>
You can edit what navigation links appear by changing the
<code>NAVIGATION_LINKS</code> variable in conf.py. See this section of the
handbook: <a href="http://getnikola.com/handbook.html#configuration">http://getnikola.com/handbook.html#configuration</a>
</p>

<hr>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Adding Disqus comments</h3>
<div class="outline-text-3" id="text-2-5">
<p>
I already had a Disqus account for my old site. Adding
functionality for Disqus comments to my new Nikola-based site was
incredibly simple.
</p>

<p>
In <b>conf.py</b>, I set the following two variables:
</p>

<div class="highlight"><pre><span class="n">COMMENT_SYSTEM</span> <span class="o">=</span> <span class="s">"disqus"</span>
<span class="n">COMMENT_SYSTEM_ID</span> <span class="o">=</span> <span class="s">"MY_SHORT_NAME"</span>
</pre></div>

<p>
The shortname for the Disqus site can be found using <a href="https://help.disqus.com/customer/portal/articles/466208-what-s-a-shortname-">these
instructions</a>.
</p>

<hr>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6">Redirects</h3>
<div class="outline-text-3" id="text-2-6">
<p>
One of my old pages was linked to by another website. For this
reason, I wanted to preserve this URL so that the other site's
owner didn't have to update the link himself.
</p>

<p>
Nikola makes it easy to setup a redirect in <b>conf.py</b>. I changed
the <b>REDIRECTIONS</b> variable to the following:
</p>

<div class="highlight"><pre><span class="n">REDIRECTIONS</span> <span class="o">=</span> <span class="p">[(</span><span class="s">"notes/pgFocus.html"</span><span class="p">,</span> <span class="s">"/stories/notes/pgFocus.html"</span><span class="p">)]</span>
</pre></div>

<hr>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7">Code syntax highlighting and the orgmode plugin</h3>
<div class="outline-text-3" id="text-2-7">
<p>
To get code syntax highlighting with Pygments working, I needed to
generate a custom.css file with pygments and add it to my theme's
css files. I got this information from the following thread on the
Nikola mailing list:
<a href="https://groups.google.com/forum/#!topic/nikola-discuss/pRgevspZgvM">https://groups.google.com/forum/#!topic/nikola-discuss/pRgevspZgvM</a>
</p>

<p>
First, I found the available styles for highlighting with the
command:
</p>

<div class="highlight"><pre>pygmentize -L style
</pre></div>

<p>
After choosing a style, I generated the custom css with
</p>

<div class="highlight"><pre>pygmentize -S default -a .highlight -f html
</pre></div>

<p>
and placed the output in <b>custom.css</b>. I placed this css file in
<b>&lt;NIKOLA_ROOT&gt;/themes/custom_theme/assests/css/</b>. After this,
highlighting worked on my site.
</p>

<hr>
</div>
</div>
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8">Teasers</h3>
<div class="outline-text-3" id="text-2-8">
<p>
To only include portions of posts on the index page, you have to
set the <code>INDEX_TEASERS</code> variable to <code>True</code>. By default, only the
RSS feed will include teasers.
</p>

<p>
I'm not currently sure how to implemement this with the orgmode
Nikola plugin, however. I tried surrounding the reStructuredText
<code>.. TEASER_END</code> in #+BEGIN/END_COMMENT brackets, but this did not
work.
</p>

<hr>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9">Adding MathJax support to all pages</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Adding MathJax suppport involves inserting a link to the global
MathJax server through script tags in the head tags of every page.
</p>

<p>
I can add this link by editing the following variable in my
<b>conf.py</b> file:
</p>

<div class="highlight"><pre><span class="n">EXTRA_HEAD_DATA</span> <span class="o">=</span> <span class="s">'''&amp;lt;script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"&amp;gt;&amp;lt;/script&amp;gt;'''</span>
</pre></div>

<p>
(Note that you will have to replace any occurence of &amp;lt; and &amp;gt;
to less-than and greater-than symbols above. For whatever reason
org-mode will ALWAYS try to render these into HTML and I haven't
figure out how to prevent this). After doing this, MathJax will
automatically used to render LaTeX equations into math. Very nice
and simple!
</p>
<hr>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Errors</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Duplicated definition of render_listings</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Shortly after switching my GitHub user page from Jekyll to Nikola,
I received the following error while running the command <code>nikola
   github_deploy</code>:
</p>

<div class="highlight"><pre>ERROR: Task generation <span class="s1">'render_site'</span> has duplicated definition of <span class="s1">'render_listings:output/listings/index.html'</span>
<span class="o">[</span>2014-12-27T15:09:48Z<span class="o">]</span> ERROR: github_deploy: Build failed, not deploying to GitHub
</pre></div>

<p>
I deleted the cache and <span class="underline"><span class="underline">pycache</span></span> directories and the doit
database files after reading around the internet, but this didn't
fix the problem. Ultimately, I deleted the listings folder which
fixed it, though I'm not sure how good of a fix this is, since I
may want to use the feature enabled by listings in the future. I
believe that this feature is easy insertion of formatted code into
webpages.
</p>
</div>
</div>
</div>
    </div>
    

</article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2015         <a href="mailto:kyle.douglass@epfl.ch">Kyle M. Douglass</a> - Powered by         <a href="http://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
